{
    "name": "Phát hiện mô hình Diffusion",
    "description": "Phát hiện hiện vật đặc trưng của mô hình AI dựa trên khuếch tán (Stable Diffusion, DALL-E, Midjourney) bằng cách phân tích dư từ bước khử nhiễu và mẫu không gian ẩn đặc trưng cho quá trình sinh ảnh khử nhiễu lặp.",
    "algorithm": "Phân tích dư bước Diffusion + Phát hiện mẫu không gian ẩn",
    "mechanism": "Phương pháp phát hiện:\n\n1. **Trích xuất dư tần cao**: Trích xuất dư tần số cao tương quan với quá trình khử nhiễu lặp.\n\n2. **Tự tương quan không gian**: Mô hình diffusion hoạt động trong không gian ẩn nén, tạo mẫu tương quan đặc trưng khi giải mã về pixel.\n\n3. **Phát hiện hiện vật khử nhiễu**: Quá trình khử nhiễu từng bước để lại dấu vết tinh tế, đặc biệt trong vùng gradient mượt.\n\n4. **Mẫu cross-attention**: Mô hình chuyển văn bản thành ảnh sử dụng cross-attention tạo mẫu nhất quán không gian.",
    "parameters": "Cửa sổ phân tích: 64x64, Trích nhiễu: bộ lọc Wiener\nTương quan không gian: bản đồ tự tương quan\nMô hình mục tiêu: Stable Diffusion 1.5/2.1/XL, DALL-E 2/3, Midjourney v4/v5/v6",
    "accuracy": "Cao - 86-94%. Hiệu quả thay đổi theo phiên bản mô hình.",
    "source": "Corvi et al. (2023) - On the Detection of Synthetic Images Generated by Diffusion Models",
    "useCase": "Phát hiện nội dung sinh bởi mô hình AI diffusion hiện đại.",
    "strengths": "• Thiết kế chuyên biệt cho mô hình diffusion hiện đại\n• Phát hiện cả đầu ra diffusion chất lượng cao\n• Hoạt động trên nhiều kiến trúc diffusion\n• Hiệu quả với cả text-to-image và image-to-image",
    "limitations": "• Mô hình phát triển nhanh đòi hỏi cập nhật thường xuyên\n• Img2img với denoising strength cao khó phát hiện\n• Vùng sinh rất nhỏ có thể tránh phát hiện\n• Tinh chỉnh mô hình có thể thay đổi mẫu",
    "references": [
        {"title": "Corvi, R. et al. (2023). On the Detection of Synthetic Images Generated by Diffusion Models. ICASSP.", "url": "https://arxiv.org/abs/2211.00680"},
        {"title": "Ricker, J. et al. (2022). Towards the Detection of Diffusion Model Deepfakes.", "url": "https://arxiv.org/abs/2210.14571"},
        {"title": "Sha, Z. et al. (2023). DE-FAKE: Detection and Attribution. ACM CCS.", "url": "https://arxiv.org/abs/2210.06998"},
        {"title": "Wang, Z. et al. (2023). DIRE for Diffusion-Generated Image Detection. ICCV.", "url": "https://arxiv.org/abs/2303.09295"}
    ]
}
