{
    "name": "Noise Residual Analysis",
    "description": "Examines high-frequency noise patterns by applying Wiener deconvolution. Real cameras produce characteristic sensor noise that varies across the image, while AI generates unnaturally uniform noise patterns.",
    "algorithm": "Wiener Filter Noise Residual Extraction",
    "mechanism": "The analysis process:\n\n1. **Noise extraction**: Applies Wiener deconvolution filter to separate the noise component from image content.\n\n2. **Local variance mapping**: Computes local noise variance across overlapping blocks to create a noise variance heatmap.\n\n3. **Uniformity analysis**: Real camera noise varies due to sensor manufacturing imperfections (Photo Response Non-Uniformity). AI images lack this variation.\n\n4. **Statistical profiling**: Analyzes noise distribution statistics (kurtosis, skewness) against known camera noise models.",
    "parameters": "Filter: Wiener deconvolution, Window: 5x5\nBlock size: 16x16 with 50% overlap\nNoise model: Gaussian + Poisson (heteroscedastic)\nMetrics: local variance, kurtosis, skewness",
    "accuracy": "High - 82-92%. Most effective when comparing against known camera noise profiles.",
    "source": "Chen et al. (2008) - Determining Image Origin and Integrity Using Sensor Noise, IEEE TIFS",
    "useCase": "Detecting AI images through abnormally uniform noise patterns. Also used for camera source identification and tampering detection.",
    "strengths": "• Robust against content manipulation\n• Camera-specific noise is extremely difficult to forge\n• Works across different image formats\n• Can identify specific camera models",
    "limitations": "• Effectiveness reduced by heavy denoising or compression\n• Requires sufficient image resolution\n• Some AI models now add synthetic noise to evade detection\n• Social media compression degrades noise patterns",
    "references": [
        {"title": "Chen, M. et al. (2008). Determining Image Origin and Integrity Using Sensor Noise. IEEE TIFS.", "url": "https://doi.org/10.1109/TIFS.2007.916285"},
        {"title": "Lukas, J., Fridrich, J. & Goljan, M. (2006). Digital Camera Identification from Sensor Pattern Noise. IEEE TIFS.", "url": "https://doi.org/10.1109/TIFS.2006.873602"},
        {"title": "Cozzolino, D. & Verdoliva, L. (2020). Noiseprint: A CNN-Based Camera Model Fingerprint. IEEE TIFS.", "url": "https://doi.org/10.1109/TIFS.2019.2916364"}
    ]
}
