{
    "name": "Metadata Analysis",
    "description": "Comprehensive examination of EXIF, XMP, and IPTC data embedded in image files to detect signs of AI generation tools. Analyzes camera make/model, GPS coordinates, processing software, creation timestamps, and file structure to verify image authenticity.",
    "algorithm": "Multi-layer EXIF / XMP / IPTC Parser",
    "mechanism": "The metadata analysis system operates in multiple stages:\n\n1. **Data Extraction**: Reads all EXIF (Exchangeable Image File Format), XMP (Extensible Metadata Platform), and IPTC (International Press Telecommunications Council) metadata fields embedded in the image.\n\n2. **Camera Verification**: Examines Make, Model, LensModel fields to verify the capture device. AI images typically lack or contain fabricated camera information.\n\n3. **Software Detection**: Identifies Software, CreatorTool, HistorySoftwareAgent tags containing AI tool names such as 'Stable Diffusion', 'DALL-E', 'Midjourney', 'Adobe Firefly'.\n\n4. **Timestamp Validation**: Cross-references DateTimeOriginal, DateTimeDigitized, ModifyDate to detect temporal anomalies.\n\n5. **GPS Analysis**: Checks GPSLatitude, GPSLongitude — AI images rarely contain authentic GPS coordinates.",
    "parameters": "Primary EXIF fields: Make, Model, Software, GPSLatitude, GPSLongitude, DateTimeOriginal, ColorSpace, ExifVersion, XMP:CreatorTool, XMP:History, IPTC:DigitalSourceType\n\nDetected AI tools: Stable Diffusion, DALL-E, Midjourney, Adobe Firefly, ComfyUI, Automatic1111, InvokeAI\n\nMetadata standards: EXIF 2.32 (JEITA CP-3451), Adobe XMP 2.0, IPTC PMD 2024.1",
    "accuracy": "High - 85-95% when metadata is present and unstripped. However, many social media platforms (Facebook, Twitter, Instagram) automatically strip metadata on upload, reducing effectiveness.",
    "source": "JEITA CP-3451 (Exif Standard 2.32), Adobe XMP Specification Parts 1-3 (ISO 16684), IPTC Photo Metadata Standard 2024.1, C2PA Technical Specification",
    "useCase": "First-pass triage: quickly identifies images with AI software tags, missing authentic camera metadata, or inconsistent metadata. This is the first step in the analysis pipeline due to its speed and low computational cost.",
    "strengths": "• Extremely fast analysis time (< 10ms per image)\n• No pixel decoding required, only reads file headers\n• High accuracy when metadata is intact\n• Can identify specific AI tools through software tags\n• Compliant with international standards (EXIF, XMP, IPTC, C2PA)",
    "limitations": "• Metadata can be easily stripped or forged\n• Many social media platforms auto-strip metadata on upload\n• Cannot detect AI images that have had metadata removed\n• Depends on whether AI tools embed software tags",
    "references": [
        {"title": "JEITA CP-3451C — Exchangeable Image File Format (Exif) Version 2.32", "url": "https://www.cipa.jp/std/documents/download_e.html?DC-008-Translation-2023-E"},
        {"title": "Adobe XMP Specification Part 1: Data Model, Serialization, and Core Properties", "url": "https://developer.adobe.com/xmp/docs/"},
        {"title": "IPTC Photo Metadata Standard 2024.1", "url": "https://iptc.org/standards/photo-metadata/"},
        {"title": "C2PA Technical Specification — Coalition for Content Provenance and Authenticity", "url": "https://c2pa.org/specifications/specifications/2.0/specs/C2PA_Specification.html"},
        {"title": "Kee, E. & Farid, H. (2011). A Perceptual Metric for Photo Retouching. PNAS.", "url": "https://doi.org/10.1073/pnas.1110747108"},
        {"title": "Gloe, T. & Böhme, R. (2010). The Dresden Image Database for Benchmarking Digital Image Forensics. ACM SAC.", "url": "https://doi.org/10.1145/1774088.1774427"}
    ]
}
