{
    "name": "Phân tích Metadata",
    "description": "Kiểm tra toàn diện dữ liệu EXIF, XMP và IPTC nhúng trong file ảnh để tìm dấu hiệu của công cụ tạo ảnh AI. Phân tích nhãn hiệu/model máy ảnh, tọa độ GPS, phần mềm xử lý, dấu thời gian tạo, và cấu trúc file để xác định nguồn gốc xác thực của ảnh.",
    "algorithm": "Bộ phân tích đa tầng EXIF / XMP / IPTC",
    "mechanism": "Hệ thống phân tích metadata hoạt động theo nhiều giai đoạn:\n\n1. **Trích xuất dữ liệu**: Đọc tất cả trường metadata EXIF (Exchangeable Image File Format), XMP (Extensible Metadata Platform) và IPTC (International Press Telecommunications Council) nhúng trong ảnh.\n\n2. **Phân tích camera**: Kiểm tra các trường Make, Model, LensModel để xác minh thiết bị chụp. Ảnh AI thường không có hoặc có thông tin camera giả mạo.\n\n3. **Kiểm tra phần mềm**: Phát hiện các thẻ Software, CreatorTool, HistorySoftwareAgent chứa tên công cụ AI như 'Stable Diffusion', 'DALL-E', 'Midjourney', 'Adobe Firefly'.\n\n4. **Xác minh thời gian**: So sánh DateTimeOriginal, DateTimeDigitized, ModifyDate để tìm bất thường thời gian.\n\n5. **Phân tích GPS**: Kiểm tra GPSLatitude, GPSLongitude — ảnh AI hiếm khi có tọa độ GPS xác thực.",
    "parameters": "Các trường EXIF chính: Make, Model, Software, GPSLatitude, GPSLongitude, DateTimeOriginal, ColorSpace, ExifVersion, XMP:CreatorTool, XMP:History, IPTC:DigitalSourceType\n\nCác công cụ AI được phát hiện: Stable Diffusion, DALL-E, Midjourney, Adobe Firefly, ComfyUI, Automatic1111, InvokeAI\n\nTiêu chuẩn metadata: EXIF 2.32 (JEITA CP-3451), Adobe XMP 2.0, IPTC PMD 2024.1",
    "accuracy": "Cao - 85-95% khi metadata có sẵn và chưa bị xóa. Tuy nhiên, nhiều nền tảng mạng xã hội (Facebook, Twitter, Instagram) tự động xóa metadata khi tải lên, làm giảm hiệu quả phương pháp này.",
    "source": "JEITA CP-3451 (Exif Standard 2.32), Adobe XMP Specification Part 1-3 (ISO 16684), IPTC Photo Metadata Standard 2024.1, C2PA (Coalition for Content Provenance and Authenticity) Technical Specification",
    "useCase": "Sàng lọc nhanh ban đầu: xác định ảnh có thẻ phần mềm AI, thiếu metadata camera xác thực, hoặc có metadata không nhất quán. Đây là bước đầu tiên trong quy trình phân tích vì nhanh chóng và chi phí tính toán thấp.",
    "strengths": "• Tốc độ phân tích cực nhanh (< 10ms mỗi ảnh)\n• Không cần giải mã pixel, chỉ đọc header file\n• Độ chính xác cao khi metadata còn nguyên vẹn\n• Có thể phát hiện công cụ AI cụ thể qua thẻ phần mềm\n• Tuân thủ các tiêu chuẩn quốc tế (EXIF, XMP, IPTC, C2PA)",
    "limitations": "• Metadata có thể bị xóa hoặc giả mạo dễ dàng\n• Nhiều mạng xã hội tự động strip metadata khi upload\n• Không phát hiện được ảnh AI đã được xóa metadata\n• Phụ thuộc vào việc công cụ AI có ghi thẻ phần mềm hay không",
    "references": [
        {"title": "JEITA CP-3451C — Exchangeable Image File Format (Exif) Version 2.32", "url": "https://www.cipa.jp/std/documents/download_e.html?DC-008-Translation-2023-E"},
        {"title": "Adobe XMP Specification Part 1: Data Model, Serialization, and Core Properties", "url": "https://developer.adobe.com/xmp/docs/"},
        {"title": "IPTC Photo Metadata Standard 2024.1", "url": "https://iptc.org/standards/photo-metadata/"},
        {"title": "C2PA Technical Specification — Coalition for Content Provenance and Authenticity", "url": "https://c2pa.org/specifications/specifications/2.0/specs/C2PA_Specification.html"},
        {"title": "Kee, E. & Farid, H. (2011). A Perceptual Metric for Photo Retouching. Proceedings of the National Academy of Sciences.", "url": "https://doi.org/10.1073/pnas.1110747108"},
        {"title": "Gloe, T. & Böhme, R. (2010). The Dresden Image Database for Benchmarking Digital Image Forensics. ACM SAC.", "url": "https://doi.org/10.1145/1774088.1774427"}
    ]
}
