{
    "useCase": "Verifying physical plausibility of lighting and shadow configurations in images",
    "mechanism": "Estimates light source direction using spherical harmonics decomposition on detected surfaces and objects. Compares estimated lighting vectors across different image regions. AI-generated images often contain physically impossible lighting configurations where shadow directions contradict the apparent light source position.",
    "accuracy": "Moderate - 70-80% on images with clear lighting cues",
    "name": "Illumination Consistency Analysis",
    "source": "Johnson & Farid (2005) - Exposing Digital Forgeries by Detecting Inconsistencies in Lighting, ACM Workshop",
    "algorithm": "Spherical Harmonics Light Direction Estimation",
    "parameters": "Harmonics: order 2 (9 coefficients), Surface normal estimation: shape-from-shading, Light probes: face/object regions, Consistency metric: angular deviation",
    "description": "Estimates light source direction and consistency across image regions. AI images often have physically impossible lighting configurations with inconsistent shadow directions.",
    "strengths": "• Based on physics of light propagation\n• Detects physically impossible scenes\n• Effective for composite image detection\n• Works on both indoor and outdoor scenes",
    "limitations": "• Requires identifiable surfaces for normal estimation\n• Complex scenes with multiple light sources are challenging\n• Diffuse lighting reduces detection accuracy\n• Modern AI models improving at lighting consistency",
    "references": [
        {
            "title": "Johnson, M.K. & Farid, H. (2005). Exposing Digital Forgeries by Detecting Inconsistencies in Lighting. ACM Workshop MMS.",
            "url": "https://doi.org/10.1145/1073170.1073171"
        },
        {
            "title": "Kee, E. et al. (2013). Exposing Digital Photo Manipulation with Inconsistent Shadows. ACM TOMM.",
            "url": "https://doi.org/10.1145/2501636"
        }
    ]
}
