{
    "api.methods.frequency_band.name":  "Frequency Band Analysis",
    "api.methods.frequency_band.desc":  "Decomposes image into multiple frequency sub-bands using filter banks. AI-generated images show anomalous energy distribution across bands due to upsampling artifacts.",
    "api.methods.face_landmark.name":  "Face Landmark Consistency",
    "api.methods.face_landmark.desc":  "Detects inconsistencies in facial landmark positions using 68-point face mesh. AI-generated faces often have subtle geometric anomalies.",
    "api.methods.lighting.name":  "Illumination Consistency Analysis",
    "api.methods.lighting.desc":  "Estimates light source direction and consistency across image regions. AI images often have physically impossible lighting configurations.",
    "api.methods.shadow.name":  "Shadow Consistency Analysis",
    "api.methods.shadow.desc":  "Analyzes shadow geometry, direction, and softness for physical plausibility. AI models struggle to maintain consistent shadow casting.",
    "api.methods.perspective.name":  "Perspective Geometry Analysis",
    "api.methods.perspective.desc":  "Checks geometric consistency of parallel lines, vanishing points, and depth cues. AI-generated scenes often contain perspective distortions.",
    "api.methods.reflection.name":  "Reflection Consistency Analysis",
    "api.methods.reflection.desc":  "Examines reflections in eyes, glasses, and surfaces for physical accuracy. AI models frequently generate physically impossible reflections.",
    "api.methods.double_jpeg.name":  "Double JPEG Compression Detection",
    "api.methods.double_jpeg.desc":  "Detects traces of double JPEG compression by analyzing DCT coefficient histograms. Tampering often involves re-saving, creating detectable periodic patterns.",
    "api.methods.patchforensics.name":  "Patch-based Forensics (CNN)",
    "api.methods.patchforensics.desc":  "Uses CNN classifiers on small image patches to detect local manipulations. Each patch is independently classified, creating a manipulation probability map.",
    "api.methods.clip_detection.name":  "CLIP-based AI Detection",
    "api.methods.clip_detection.desc":  "Leverages OpenAI CLIP vision-language model to detect semantic inconsistencies. Uses contrastive learning for zero-shot AI content detection.",
    "api.methods.binary_pattern.name":  "Local Binary Pattern (LBP) Analysis",
    "api.methods.binary_pattern.desc":  "Extracts micro-texture descriptors using LBP operators. AI-generated images produce distinct LBP histogram distributions compared to natural photographs.",
    "api.methods.fourier_ring.name":  "Fourier Ring Pattern Detection",
    "api.methods.fourier_ring.desc":  "Detects periodic ring patterns in 2D Fourier spectrum caused by GAN upsampling operations. These spectral anomalies are invisible to human eyes.",
    "api.methods.resnet_classifier.name":  "ResNet Binary Classifier",
    "api.methods.resnet_classifier.desc":  "Fine-tuned ResNet-50 deep neural network trained on large-scale real vs. AI-generated image datasets using transfer learning from ImageNet.",
    "api.methods.vit_detection.name":  "Vision Transformer (ViT) Detection",
    "api.methods.vit_detection.desc":  "Uses Vision Transformer architecture to capture long-range dependencies in images. ViT excels at detecting subtle global patterns that CNNs may miss.",
    "api.methods.gram_matrix.name":  "Gram Matrix Texture Analysis",
    "api.methods.gram_matrix.desc":  "Computes Gram matrix from CNN feature maps to capture style and texture correlations. AI images produce distinctive patterns different from natural photos.",
    "api.methods.srm_filter.name":  "SRM Filter Analysis",
    "api.methods.srm_filter.desc":  "Applies Spatial Rich Model (SRM) high-pass filters to extract noise residuals. 30 hand-crafted filters effectively detect AI generation artifacts."
}