{
    "name": "Phân tích mức lỗi (ELA)",
    "description": "Phương pháp phân tích mức lỗi (Error Level Analysis) lưu lại ảnh ở chất lượng JPEG đã biết và so sánh mức lỗi giữa ảnh gốc và ảnh tái nén. Ảnh AI tạo ra mẫu lỗi đồng nhất bất thường, trong khi ảnh thật có biến đổi nén khác nhau theo vùng.",
    "algorithm": "Phân tích sai biệt nén JPEG lại (JPEG Re-compression Differential)",
    "mechanism": "Quy trình phân tích ELA:\n\n1. **Tái nén ảnh**: Ảnh được lưu lại ở mức chất lượng JPEG cố định (thường 95%).\n\n2. **Tính sai biệt**: So sánh pixel-by-pixel giữa ảnh gốc và ảnh tái nén, tạo bản đồ sai biệt tuyệt đối.\n\n3. **Phân tích mẫu lỗi**: Trong ảnh JPEG chưa chỉnh sửa, toàn bộ ảnh đã trải qua cùng mức nén, nên mức lỗi tương đối đồng nhất. Vùng bị thao tác hoặc AI tạo có mức lỗi khác biệt vì đã trải qua quá trình nén khác.\n\n4. **Đánh giá tính đồng nhất**: Ảnh AI thường cho thấy mức lỗi đồng nhất bất thường trên toàn ảnh vì tất cả pixel đều được sinh ra, không phải chụp.",
    "parameters": "Mức chất lượng tái nén: 95%, Không gian màu: YCbCr, Kích thước khối DCT: 8x8\nPhân tích: sai biệt tuyệt đối pixel, phương sai mức lỗi theo vùng\nNgưỡng: adaptive dựa trên phân phối lỗi toàn cục",
    "accuracy": "Cao - 88-94% cho ảnh JPEG. Hiệu quả giảm đáng kể với ảnh PNG hoặc ảnh đã được nén nhiều lần.",
    "source": "Krawetz, N. (2007) — A Picture's Worth: Digital Image Analysis and Forensics. Hacker Factor Solutions.",
    "useCase": "Phát hiện thao tác cục bộ (vùng bị cắt dán, chỉnh sửa), AI inpainting, và vùng có lịch sử nén không nhất quán. Phổ biến trong phân tích pháp y ảnh số và kiểm chứng nội dung.",
    "strengths": "• Trực quan, dễ hiểu cho người dùng không chuyên\n• Phát hiện tốt thao tác cục bộ và ghép nối\n• Chi phí tính toán thấp, phân tích nhanh\n• Hiệu quả đặc biệt với ảnh JPEG một lần nén",
    "limitations": "• Chỉ hiệu quả với ảnh JPEG, không áp dụng được cho PNG/WebP\n• Ảnh JPEG bị nén nhiều lần làm nhiễu kết quả\n• Ảnh resize hoặc crop tạo ra dương tính giả\n• Không phân biệt được AI và ảnh thật đã qua xử lý hậu kỳ nặng",
    "references": [
        {"title": "Krawetz, N. (2007). A Picture's Worth: Digital Image Analysis and Forensics. Hacker Factor.", "url": "https://fotoforensics.com/tutorial-ela.php"},
        {"title": "Krawetz, N. (2012). A Picture's Worth — More on ELA. Black Hat USA.", "url": "https://www.hackerfactor.com/papers/bh-usa-07-krawetz-wp.pdf"},
        {"title": "Farid, H. (2009). Image Forgery Detection. IEEE Signal Processing Magazine.", "url": "https://doi.org/10.1109/MSP.2008.931079"},
        {"title": "Popescu, A.C. & Farid, H. (2005). Exposing Digital Forgeries by Detecting Traces of Resampling. IEEE TSP.", "url": "https://doi.org/10.1109/TSP.2004.839932"}
    ]
}
